---
kind: other
id: Methods.T:Autodesk.Revit.DB.ProjectLocation
source: html/3636ac05-05ad-dda1-f412-29034422ca47.htm
---
# ProjectLocation Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.